app/controllers/posts_controller.rb

  def index
    @authors = Author.all  #Provide a list of authors tot he view for the filter control

    if !params[:author].blank? #This section filters the @posts list based on user input
      @posts = Post.by_author(params[:author])
      # @posts = Post.where(author: params[:author])

      elsif !params[:date].blank?
        if params[:date] == "Today"
          # @posts = Post.where("created_at >=?", Time.zone.today.beginning_of_day)
          @posts = Post.from_today
        else
          # @posts = Post.where("created_at <?", Time.zone.today.beginning_of_day)
          @posts = Post.old_news
        end
      else
        @posts = Post.all  #If no filters are applied, show all posts.
      end
---
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')